tests/load/artillery.yaml
config:
  target: "https://sandbox--hippo-prototype.netlify.app/"
  phases:
    - duration: 60
      arrivalRate: 5
      maxVusers: 50
  engines:
    playwright: {}
  processor: ./flows.js
scenarios:
  - name: "Upload paper, ask question & give full feedback"
    engine: playwright
    flowFunction: "uploadAskAndGiveFeedbackFlow"
    flow: []


# Using in .github workflow:
# https://www.artillery.io/docs/guides/integration-guides/github-actions

# Running tests from lambda
# https://www.artillery.io/docs/guides/guides/distributed-load-tests-on-aws-lambda