tests/load/artillery.yaml
config:
  target: "http://localhost:3000/"
  phases:
    - duration: 60
      arrivalRate: 25
  engines:
    playwright: {}
  processor: ./flows.js
scenarios:
  - name: "Upload paper, ask question & give full feedback"
    engine: playwright
    flowFunction: "uploadAskAndGiveFeedbackFlow"
    flow: []


# Using in .github workflow:
# https://www.artillery.io/docs/guides/integration-guides/github-actions

# Running tests from lambda
# https://www.artillery.io/docs/guides/guides/distributed-load-tests-on-aws-lambda